<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"azurerm","backend":"b99413a7ed604a81e9bbd4d40b9c18d21889a98c95095a77510b9dff880ee708","plan_job_ref":"Job CI-CD pipeline #116 at https://github.com/HasanAshab/spring-react-devops-appservice-infra/actions/runs/16613829308","plan_out_hash":"175b7eee1be7a868b22603944e0ee7e42fbbc155fc42c86d19d6878bd786d0ac","plan_hash":"6fb3ff7ac59a0a6e5b4fd20e60fcd71024a2d20779be55a402927b6eeee37bb5","plan_text_format":"diff","version":"2.1.0"} -->
Terraform plan in __.__ in the __dev__ workspace
With var files: `dev.tfvars`
<details>
<summary>Plan: 46 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_resource_group.this["centralus"] will be created
+   resource "azurerm_resource_group" "this" {
+       id       = (known after apply)
+       location = "centralus"
+       name     = "rg-three-tier-app-dev-centralus"
    }

  # azurerm_resource_group.this["eastus"] will be created
+   resource "azurerm_resource_group" "this" {
+       id       = (known after apply)
+       location = "eastus"
+       name     = "rg-three-tier-app-dev-eastus"
    }

  # azurerm_virtual_network.this["centralus"] will be created
+   resource "azurerm_virtual_network" "this" {
+       address_space                  = [
+           "10.254.0.0/16",
        ]
+       dns_servers                    = (known after apply)
+       guid                           = (known after apply)
+       id                             = (known after apply)
+       location                       = "centralus"
+       name                           = "vnet-three-tier-app-dev-centralus"
+       private_endpoint_vnet_policies = "Disabled"
+       resource_group_name            = "rg-three-tier-app-dev-centralus"
+       subnet                         = (known after apply)
    }

  # azurerm_virtual_network.this["eastus"] will be created
+   resource "azurerm_virtual_network" "this" {
+       address_space                  = [
+           "10.254.0.0/16",
        ]
+       dns_servers                    = (known after apply)
+       guid                           = (known after apply)
+       id                             = (known after apply)
+       location                       = "eastus"
+       name                           = "vnet-three-tier-app-dev-eastus"
+       private_endpoint_vnet_policies = "Disabled"
+       resource_group_name            = "rg-three-tier-app-dev-eastus"
+       subnet                         = (known after apply)
    }

  # module.backend["centralus"].azurerm_subnet.this will be created
+   resource "azurerm_subnet" "this" {
+       address_prefixes                              = [
+           "10.254.0.64/26",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = (known after apply)
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "rg-three-tier-app-dev-centralus"
+       virtual_network_name                          = "vnet-three-tier-app-dev-centralus"

+       delegation {
+           name = "webapp"

+           service_delegation {
+               actions = [
+                   "Microsoft.Network/virtualNetworks/subnets/action",
                ]
+               name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.backend["eastus"].azurerm_subnet.this will be created
+   resource "azurerm_subnet" "this" {
+       address_prefixes                              = [
+           "10.254.0.64/26",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = (known after apply)
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "rg-three-tier-app-dev-eastus"
+       virtual_network_name                          = "vnet-three-tier-app-dev-eastus"

+       delegation {
+           name = "webapp"

+           service_delegation {
+               actions = [
+                   "Microsoft.Network/virtualNetworks/subnets/action",
                ]
+               name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.database.azurerm_mysql_flexible_database.this will be created
+   resource "azurerm_mysql_flexible_database" "this" {
+       charset             = "utf8mb4"
+       collation           = "utf8mb4_unicode_ci"
+       id                  = (known after apply)
+       name                = "db"
+       resource_group_name = "rg-three-tier-app-dev-centralus"
+       server_name         = "mysql-db-three-tier-app-dev-centralus"
    }

  # module.database.azurerm_mysql_flexible_server.this will be created
+   resource "azurerm_mysql_flexible_server" "this" {
+       administrator_login               = "admin4321"
+       administrator_password_wo         = (write-only attribute)
+       administrator_password_wo_version = 1
+       backup_retention_days             = 1
+       fqdn                              = (known after apply)
+       geo_redundant_backup_enabled      = false
+       id                                = (known after apply)
+       location                          = "centralus"
+       name                              = "mysql-db-three-tier-app-dev-centralus"
+       public_network_access             = "Disabled"
+       public_network_access_enabled     = (known after apply)
+       replica_capacity                  = (known after apply)
+       replication_role                  = (known after apply)
+       resource_group_name               = "rg-three-tier-app-dev-centralus"
+       sku_name                          = "B_Standard_B1ms"
+       version                           = "8.0.21"
+       zone                              = (known after apply)

+       storage {
+           auto_grow_enabled   = false
+           io_scaling_enabled  = false
+           iops                = (known after apply)
+           log_on_disk_enabled = false
+           size_gb             = 20
        }
    }

  # module.database.azurerm_private_dns_zone.this will be created
+   resource "azurerm_private_dns_zone" "this" {
+       id                                                    = (known after apply)
+       max_number_of_record_sets                             = (known after apply)
+       max_number_of_virtual_network_links                   = (known after apply)
+       max_number_of_virtual_network_links_with_registration = (known after apply)
+       name                                                  = "privatelink.mysql.database.azure.com"
+       number_of_record_sets                                 = (known after apply)
+       resource_group_name                                   = "rg-three-tier-app-dev-centralus"

+       soa_record (known after apply)
    }

  # module.database.azurerm_private_dns_zone_virtual_network_link.this will be created
+   resource "azurerm_private_dns_zone_virtual_network_link" "this" {
+       id                    = (known after apply)
+       name                  = "dns-link"
+       private_dns_zone_name = "privatelink.mysql.database.azure.com"
+       registration_enabled  = false
+       resource_group_name   = "rg-three-tier-app-dev-centralus"
+       virtual_network_id    = (known after apply)
    }

  # module.database.azurerm_private_endpoint.default will be created
+   resource "azurerm_private_endpoint" "default" {
+       custom_dns_configs       = (known after apply)
+       id                       = (known after apply)
+       location                 = "centralus"
+       name                     = "pe-db-three-tier-app-dev-centralus"
+       network_interface        = (known after apply)
+       private_dns_zone_configs = (known after apply)
+       resource_group_name      = "rg-three-tier-app-dev-centralus"
+       subnet_id                = (known after apply)

+       private_dns_zone_group {
+           id                   = (known after apply)
+           name                 = "dns-zone-group1"
+           private_dns_zone_ids = (known after apply)
        }

+       private_service_connection {
+           is_manual_connection           = false
+           name                           = "private-serviceconnection1"
+           private_connection_resource_id = (known after apply)
+           private_ip_address             = (known after apply)
+           subresource_names              = [
+               "mysqlServer",
            ]
        }
    }

  # module.database.azurerm_subnet.this will be created
+   resource "azurerm_subnet" "this" {
+       address_prefixes                              = [
+           "10.254.0.0/26",
        ]
+       default_outbound_access_enabled               = true
+       id                                            = (known after apply)
+       name                                          = (known after apply)
+       private_endpoint_network_policies             = "Disabled"
+       private_link_service_network_policies_enabled = true
+       resource_group_name                           = "rg-three-tier-app-dev-centralus"
+       virtual_network_name                          = "vnet-three-tier-app-dev-centralus"
    }

  # module.frontdoor.azurerm_cdn_frontdoor_endpoint.this will be created
+   resource "azurerm_cdn_frontdoor_endpoint" "this" {
+       cdn_frontdoor_profile_id = (known after apply)
+       enabled                  = true
+       host_name                = (known after apply)
+       id                       = (known after apply)
+       name                     = "fd-endpoint"
    }

  # module.frontdoor.azurerm_cdn_frontdoor_origin.this["frontend-0"] will be created
+   resource "azurerm_cdn_frontdoor_origin" "this" {
+       cdn_frontdoor_origin_group_id  = (known after apply)
+       certificate_name_check_enabled = true
+       enabled                        = true
+       host_name                      = (known after apply)
+       http_port                      = 80
+       https_port                     = 443
+       id                             = (known after apply)
+       name                           = "fd-origin-frontend-0"
+       origin_host_header             = (known after apply)
+       priority                       = 1
+       weight                         = 100
    }

  # module.frontdoor.azurerm_cdn_frontdoor_origin.this["frontend-1"] will be created
+   resource "azurerm_cdn_frontdoor_origin" "this" {
+       cdn_frontdoor_origin_group_id  = (known after apply)
+       certificate_name_check_enabled = true
+       enabled                        = true
+       host_name                      = (known after apply)
+       http_port                      = 80
+       https_port                     = 443
+       id                             = (known after apply)
+       name                           = "fd-origin-frontend-1"
+       origin_host_header             = (known after apply)
+       priority                       = 1
+       weight                         = 100
    }

  # module.frontdoor.azurerm_cdn_frontdoor_origin_group.this["frontend"] will be created
+   resource "azurerm_cdn_frontdoor_origin_group" "this" {
+       cdn_frontdoor_profile_id                                  = (known after apply)
+       id                                                        = (known after apply)
+       name                                                      = "fd-origin-group-frontend"
+       restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
+       session_affinity_enabled                                  = false

+       health_probe {
+           interval_in_seconds = 30
+           path                = "/"
+           protocol            = "Https"
+           request_type        = "HEAD"
        }

+       load_balancing {
+           additional_latency_in_milliseconds = 0
+           sample_size                        = 16
+           successful_samples_required        = 3
        }
    }

  # module.frontdoor.azurerm_cdn_frontdoor_profile.this will be created
+   resource "azurerm_cdn_frontdoor_profile" "this" {
+       id                       = (known after apply)
+       name                     = "fd-profile"
+       resource_group_name      = "rg-three-tier-app-dev-centralus"
+       resource_guid            = (known after apply)
+       response_timeout_seconds = 120
+       sku_name                 = "Standard_AzureFrontDoor"
    }

  # module.frontdoor.azurerm_cdn_frontdoor_route.frontend["frontend"] will be created
+   resource "azurerm_cdn_frontdoor_route" "frontend" {
+       cdn_frontdoor_endpoint_id     = (known after apply)
+       cdn_frontdoor_origin_group_id = (known after apply)
+       cdn_frontdoor_origin_ids      = (known after apply)
+       enabled                       = true
+       forwarding_protocol           = "HttpsOnly"
+       https_redirect_enabled        = true
+       id                            = (known after apply)
+       link_to_default_domain        = true
+       name                          = "fd-route-frontend"
+       patterns_to_match             = [
+           "/*",
        ]
+       supported_protocols           = [
+           "Http",
+           "Https",
        ]
    }

  # module.naming["centralus"].random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.naming["centralus"].random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.naming["eastus"].random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.naming["eastus"].random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.asp["centralus"].module.asp.azurerm_service_plan.this will be created
+   resource "azurerm_service_plan" "this" {
+       id                              = (known after apply)
+       kind                            = (known after apply)
+       location                        = "centralus"
+       maximum_elastic_worker_count    = (known after apply)
+       name                            = "plan-three-tier-app-dev-centralus"
+       os_type                         = "Linux"
+       per_site_scaling_enabled        = false
+       premium_plan_auto_scale_enabled = false
+       reserved                        = (known after apply)
+       resource_group_name             = "rg-three-tier-app-dev-centralus"
+       sku_name                        = "B1"
+       worker_count                    = 1
+       zone_balancing_enabled          = false
    }

  # module.asp["centralus"].module.asp.modtm_telemetry.telemetry[0] will be created
+   resource "modtm_telemetry" "telemetry" {
+       ephemeral_number = (known after apply)
+       id               = (known after apply)
+       nonce            = (known after apply)
+       tags             = {
+           "location"        = "centralus"
+           "module_source"   = "git::https://github.com/Azure/terraform-azurerm-avm-res-web-serverfarm.git?ref=8ca49e2"
+           "module_version"  = null
+           "random_id"       = (known after apply)
+           "subscription_id" = "************************************"
+           "tenant_id"       = "************************************"
        }
    }

  # module.asp["centralus"].module.asp.random_uuid.telemetry[0] will be created
+   resource "random_uuid" "telemetry" {
+       id     = (known after apply)
+       result = (known after apply)
    }

  # module.asp["centralus"].module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.asp["centralus"].module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.asp["eastus"].module.asp.azurerm_service_plan.this will be created
+   resource "azurerm_service_plan" "this" {
+       id                              = (known after apply)
+       kind                            = (known after apply)
+       location                        = "eastus"
+       maximum_elastic_worker_count    = (known after apply)
+       name                            = "plan-three-tier-app-dev-eastus"
+       os_type                         = "Linux"
+       per_site_scaling_enabled        = false
+       premium_plan_auto_scale_enabled = false
+       reserved                        = (known after apply)
+       resource_group_name             = "rg-three-tier-app-dev-eastus"
+       sku_name                        = "B1"
+       worker_count                    = 1
+       zone_balancing_enabled          = false
    }

  # module.asp["eastus"].module.asp.modtm_telemetry.telemetry[0] will be created
+   resource "modtm_telemetry" "telemetry" {
+       ephemeral_number = (known after apply)
+       id               = (known after apply)
+       nonce            = (known after apply)
+       tags             = {
+           "location"        = "eastus"
+           "module_source"   = "git::https://github.com/Azure/terraform-azurerm-avm-res-web-serverfarm.git?ref=8ca49e2"
+           "module_version"  = null
+           "random_id"       = (known after apply)
+           "subscription_id" = "************************************"
+           "tenant_id"       = "************************************"
        }
    }

  # module.asp["eastus"].module.asp.random_uuid.telemetry[0] will be created
+   resource "random_uuid" "telemetry" {
+       id     = (known after apply)
+       result = (known after apply)
    }

  # module.asp["eastus"].module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.asp["eastus"].module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.backend["centralus"].module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.backend["centralus"].module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.backend["centralus"].module.webapp.azurerm_linux_web_app.this[0] will be created
+   resource "azurerm_linux_web_app" "this" {
+       app_settings                                   = (known after apply)
+       client_affinity_enabled                        = false
+       client_certificate_enabled                     = false
+       client_certificate_mode                        = "Required"
+       custom_domain_verification_id                  = (sensitive value)
+       default_hostname                               = (known after apply)
+       enabled                                        = true
+       ftp_publish_basic_authentication_enabled       = false
+       hosting_environment_id                         = (known after apply)
+       https_only                                     = true
+       id                                             = (known after apply)
+       key_vault_reference_identity_id                = (known after apply)
+       kind                                           = (known after apply)
+       location                                       = "centralus"
+       name                                           = "app-be-three-tier-app-dev-centralus"
+       outbound_ip_address_list                       = (known after apply)
+       outbound_ip_addresses                          = (known after apply)
+       possible_outbound_ip_address_list              = (known after apply)
+       possible_outbound_ip_addresses                 = (known after apply)
+       public_network_access_enabled                  = true
+       resource_group_name                            = "rg-three-tier-app-dev-centralus"
+       service_plan_id                                = (known after apply)
+       site_credential                                = (sensitive value)
+       tags                                           = {
+           "AppName" = "three-tier-app"
+           "Role"    = "Backend"
        }
+       virtual_network_backup_restore_enabled         = false
+       virtual_network_subnet_id                      = (known after apply)
+       webdeploy_publish_basic_authentication_enabled = false
+       zip_deploy_file                                = (known after apply)

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "Disabled"
+           health_check_eviction_time_in_min       = 10
+           health_check_path                       = "/"
+           http2_enabled                           = false
+           ip_restriction_default_action           = "Allow"
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.3"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction_default_action       = "Allow"
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = false
+           vnet_route_all_enabled                  = true
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_image_name   = "spring-react-devops-appservice-backend:latest"
+               docker_registry_url = "https://ghcr.io/hasanashab"
            }
        }
    }

  # module.backend["eastus"].module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.backend["eastus"].module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.backend["eastus"].module.webapp.azurerm_linux_web_app.this[0] will be created
+   resource "azurerm_linux_web_app" "this" {
+       app_settings                                   = (known after apply)
+       client_affinity_enabled                        = false
+       client_certificate_enabled                     = false
+       client_certificate_mode                        = "Required"
+       custom_domain_verification_id                  = (sensitive value)
+       default_hostname                               = (known after apply)
+       enabled                                        = true
+       ftp_publish_basic_authentication_enabled       = false
+       hosting_environment_id                         = (known after apply)
+       https_only                                     = true
+       id                                             = (known after apply)
+       key_vault_reference_identity_id                = (known after apply)
+       kind                                           = (known after apply)
+       location                                       = "eastus"
+       name                                           = "app-be-three-tier-app-dev-eastus"
+       outbound_ip_address_list                       = (known after apply)
+       outbound_ip_addresses                          = (known after apply)
+       possible_outbound_ip_address_list              = (known after apply)
+       possible_outbound_ip_addresses                 = (known after apply)
+       public_network_access_enabled                  = true
+       resource_group_name                            = "rg-three-tier-app-dev-eastus"
+       service_plan_id                                = (known after apply)
+       site_credential                                = (sensitive value)
+       tags                                           = {
+           "AppName" = "three-tier-app"
+           "Role"    = "Backend"
        }
+       virtual_network_backup_restore_enabled         = false
+       virtual_network_subnet_id                      = (known after apply)
+       webdeploy_publish_basic_authentication_enabled = false
+       zip_deploy_file                                = (known after apply)

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "Disabled"
+           health_check_eviction_time_in_min       = 10
+           health_check_path                       = "/"
+           http2_enabled                           = false
+           ip_restriction_default_action           = "Allow"
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.3"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction_default_action       = "Allow"
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = false
+           vnet_route_all_enabled                  = true
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_image_name   = "spring-react-devops-appservice-backend:latest"
+               docker_registry_url = "https://ghcr.io/hasanashab"
            }
        }
    }

  # module.database.module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.database.module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.frontend["centralus"].module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.frontend["centralus"].module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.frontend["centralus"].module.webapp.azurerm_linux_web_app.this[0] will be created
+   resource "azurerm_linux_web_app" "this" {
+       app_settings                                   = (known after apply)
+       client_affinity_enabled                        = false
+       client_certificate_enabled                     = false
+       client_certificate_mode                        = "Required"
+       custom_domain_verification_id                  = (sensitive value)
+       default_hostname                               = (known after apply)
+       enabled                                        = true
+       ftp_publish_basic_authentication_enabled       = true
+       hosting_environment_id                         = (known after apply)
+       https_only                                     = false
+       id                                             = (known after apply)
+       key_vault_reference_identity_id                = (known after apply)
+       kind                                           = (known after apply)
+       location                                       = "centralus"
+       name                                           = "app-fe-three-tier-app-dev-centralus"
+       outbound_ip_address_list                       = (known after apply)
+       outbound_ip_addresses                          = (known after apply)
+       possible_outbound_ip_address_list              = (known after apply)
+       possible_outbound_ip_addresses                 = (known after apply)
+       public_network_access_enabled                  = true
+       resource_group_name                            = "rg-three-tier-app-dev-centralus"
+       service_plan_id                                = (known after apply)
+       site_credential                                = (sensitive value)
+       tags                                           = {
+           "AppName" = "three-tier-app"
+           "Role"    = "Frontend"
        }
+       virtual_network_backup_restore_enabled         = false
+       webdeploy_publish_basic_authentication_enabled = true
+       zip_deploy_file                                = (known after apply)

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "FtpsOnly"
+           health_check_eviction_time_in_min       = 10
+           health_check_path                       = "/"
+           http2_enabled                           = false
+           ip_restriction_default_action           = "Allow"
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.3"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction_default_action       = "Allow"
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = false
+           vnet_route_all_enabled                  = false
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_image_name   = "spring-react-devops-appservice-frontend:latest"
+               docker_registry_url = "https://ghcr.io/hasanashab"
            }
        }
    }

  # module.frontend["eastus"].module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.frontend["eastus"].module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.frontend["eastus"].module.webapp.azurerm_linux_web_app.this[0] will be created
+   resource "azurerm_linux_web_app" "this" {
+       app_settings                                   = (known after apply)
+       client_affinity_enabled                        = false
+       client_certificate_enabled                     = false
+       client_certificate_mode                        = "Required"
+       custom_domain_verification_id                  = (sensitive value)
+       default_hostname                               = (known after apply)
+       enabled                                        = true
+       ftp_publish_basic_authentication_enabled       = true
+       hosting_environment_id                         = (known after apply)
+       https_only                                     = false
+       id                                             = (known after apply)
+       key_vault_reference_identity_id                = (known after apply)
+       kind                                           = (known after apply)
+       location                                       = "eastus"
+       name                                           = "app-fe-three-tier-app-dev-eastus"
+       outbound_ip_address_list                       = (known after apply)
+       outbound_ip_addresses                          = (known after apply)
+       possible_outbound_ip_address_list              = (known after apply)
+       possible_outbound_ip_addresses                 = (known after apply)
+       public_network_access_enabled                  = true
+       resource_group_name                            = "rg-three-tier-app-dev-eastus"
+       service_plan_id                                = (known after apply)
+       site_credential                                = (sensitive value)
+       tags                                           = {
+           "AppName" = "three-tier-app"
+           "Role"    = "Frontend"
        }
+       virtual_network_backup_restore_enabled         = false
+       webdeploy_publish_basic_authentication_enabled = true
+       zip_deploy_file                                = (known after apply)

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "FtpsOnly"
+           health_check_eviction_time_in_min       = 10
+           health_check_path                       = "/"
+           http2_enabled                           = false
+           ip_restriction_default_action           = "Allow"
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.3"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction_default_action       = "Allow"
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = false
+           vnet_route_all_enabled                  = false
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_image_name   = "spring-react-devops-appservice-frontend:latest"
+               docker_registry_url = "https://ghcr.io/hasanashab"
            }
        }
    }

Plan: 46 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   url = (known after apply)
```
</details>

:memo: Plan generated in [CI-CD pipeline #116](https://github.com/HasanAshab/spring-react-devops-appservice-infra/actions/runs/16613829308)